PeterDarley/lightmotron/c_project/sdkconfig.defaults
# Lightmotron ESP32-S3 default configuration
# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# PSRAM (Octal PSRAM on N16R8)
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# SPIFFS
CONFIG_SPIFFS_MAX_PARTITIONS=2
# Default (32) is too short for nested web asset paths like
# "/templates/scenes/select_scene_button_immediate.html" (52 chars).
CONFIG_SPIFFS_OBJ_NAME_LEN=64

# WiFi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32

# LWIP
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_SO_REUSE=y

# Main/app_main task: default 3584 bytes is not enough headroom to call
# lighting_activate_boot_scenes() -> activate_scene() from boot.c -- that
# call chain's scene_metadata_t local alone (5 fixed char[8][64] arrays) is
# ~2.1KB, on top of boot_init()'s own already-substantial flat local-variable
# footprint (one long function, nothing returns until boot completes).
# Overflowed with just a 7-job scene, causing a double-exception crash right
# after "Scene activated" logged. This stack is freed once app_main()
# returns (after animation_start()), so the larger size is a one-time
# boot-time cost, not a standing internal-RAM reservation.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
# Precise (hardware watchpoint) stack-overflow detection -- catches the
# exact overrunning write instead of letting corrupted state crash
# somewhere unrelated later.
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y

# mDNS
CONFIG_MDNS_MAX_SERVICES=4

# mbedTLS: use PSRAM for its SSL buffers (16KB in + 4KB out per connection,
# plus handshake/cert-bundle state) instead of internal DRAM -- otherwise
# every HTTPS connection (OTA check/download) competes with the webserver's
# client-task stacks for the same scarce internal RAM pool.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# Interrupt watchdog: ESP-IDF's own Kconfig already defaults this to 800
# (instead of 300) for PSRAM-equipped boards on plain ESP32, specifically
# because PSRAM/flash bus contention can make flash operations take longer
# -- that auto-bump doesn't apply to ESP32-S3, but this board (N16R8) has
# the same 8MB octal PSRAM and the same contention. First bumped 300->800
# to match that ESP-IDF precedent; recurred repeatedly under SPIFFS (stuck
# in spiffs_object_find_object_index_header_by_name), which motivated
# migrating "data"/"webassets" to LittleFS (see LITTLEFS_MIGRATION_NOTES.md)
# -- but recurred AGAIN post-migration, this time at 3000ms, stuck in
# LittleFS's lfs_dir_splittingcompact (a directory-block reorganization
# during json_write_file()'s atomic rename). Bumped to 5000ms alongside the
# LittleFS lookahead/cache tuning below -- and recurred a THIRD time at
# 5000ms, same lfs_dir_splittingcompact, this time during the fopen() half
# of json_write_file()'s write (esp_littlefs_file_sync inside
# vfs_littlefs_open), not the rename half. Three distinct write-adjacent
# call sites hitting the same LittleFS internal function suggests this
# isn't just "needs more lookahead" -- likely also accumulated directory
# fragmentation from this session's many crash-mid-write cycles (LittleFS
# is power-loss-safe, so these shouldn't have corrupted anything, but
# orphaned .tmp entries/relocations from repeated interrupted writes could
# still be adding real compaction work). Bumped to 8000ms as an immediate
# backstop; a clean erase of "data" (fresh directory, no accumulated
# churn) is the more durable next step if this recurs even here -- see
# LITTLEFS_MIGRATION_NOTES.md. Still well under the 30s task watchdog,
# which still catches a genuine infinite loop.
CONFIG_ESP_INT_WDT_TIMEOUT_MS=8000

# LittleFS lookahead/cache buffers: both were still at their tiny Kconfig
# defaults (128 / 512 bytes) despite "data" being an 8MB partition (~2048
# blocks). A lookahead buffer that small needs multiple scan passes to find
# free blocks during compaction, directly inflating time spent in the
# interrupt-disabled flash critical section -- the proximate cause of the
# "Interrupt wdt timeout on CPU1" panics above. 512 bytes of lookahead
# tracks 4096 blocks in a single pass (double this partition's block
# count); cache doubled too since a bigger buffered read/write reduces the
# total number of individual flash-access calls. Pure runtime tuning, not
# an on-disk format change -- safe to adjust without reformatting.
CONFIG_LITTLEFS_LOOKAHEAD_SIZE=512
CONFIG_LITTLEFS_CACHE_SIZE=4096
# 4096 = one whole flash block (block_size must be a multiple of cache_size,
# so this is the maximum). Metadata compaction (lfs_dir_compact ->
# lfs_dir_traverse) reads a directory block tag-by-tag; with a smaller cache
# every few tags miss and become another esp_flash_read, each of which
# disables the caches/interrupts on BOTH cores (IPC handshake) -- hundreds
# of them per compaction, and every recent crash was inside one. With a
# block-sized cache the block is read from flash once and traversed from RAM.

# Task Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Target
CONFIG_IDF_TARGET="esp32s3"
